{
  "version": 1,
  "challenges": [
    {
      "id": "restaurant-ordering-level1",
      "slug": "restaurant-ordering-level1",
      "order": 1,
      "title": "Restaurant Confidence Booster",
      "tagline": "Coach Piko through his first restaurant order.",
      "difficulty": "Level 1",
      "estimatedTime": "8 min",
      "recommendedFor": "Ages 7-10",
      "background": {
        "poster": "/Backgrounds/restaurant/bamboo.jpeg",
        "themeColor": "#047857"
      },
      "intro": {
        "heroTitle": "Guide Piko Through His First Restaurant Order",
        "heroSubtitle": "Piko is at the table, nervous about speaking to the waiter. Coach him through each step so he feels confident, calm, and ready to order on his own.",
        "mission": "Teach Piko how to order food politely at a restaurant. Help him practice what to say when the waiter arrives, how to explain what he wants, and how to respond with confidence.",
        "whatYoullCover": [
          "Greeting the waiter with a friendly hello.",
          "Using polite words like \"please\" when asking for food.",
          "Describing his meal choice clearly so the waiter understands.",
          "Remembering to thank the waiter after ordering.",
          "Asking for help if he feels unsure about the menu."
        ],
        "primaryCta": "Start Challenge",
        "secondaryCta": "Preview Learning Goals",
        "dismissCta": "Maybe Later"
      },
      "todos": [
        {
          "id": 1,
          "text": "Greet the waiter politely",
          "description": "Teach Piko to say hello and be friendly when the waiter arrives"
        },
        {
          "id": 2,
          "text": "Use the word 'please' when ordering",
          "description": "Help Piko understand that saying 'please' makes requests sound polite"
        },
        {
          "id": 3,
          "text": "Clearly state what food you want",
          "description": "Show Piko how to tell the waiter exactly what food he'd like to order"
        },
        {
          "id": 4,
          "text": "Say 'thank you' after ordering",
          "description": "Remind Piko to thank the waiter for helping him"
        },
        {
          "id": 5,
          "text": "Know how to ask for help if confused",
          "description": "Teach Piko that it's okay to ask questions if he doesn't understand the menu"
        }
      ],
      "conversation": {
        "openingLine": "Hi friend! I'm Piko the panda! I'm at a restaurant and I really need your help. I've never ordered food before and I'm so nervous! The waiter is about to come over... what should I do?",
        "closingLine": "Thank you SO much! You taught me exactly what to do! I know how to greet the waiter, say please, tell them what I want, say thank you, and even ask for help if I need it! My panda confidence is growing! Want to see me try it for real?",
        "successQuote": "\"Thank you SO much! You taught me exactly what to do!\"",
        "successSubtext": "Now I know how to order food at a restaurant! You're an amazing teacher!",
        "successEmotion": "My panda confidence is growing!",
        "successContinueLabel": "Choose another challenge",
        "successRestartLabel": "Try again",
        "successFooter": "Level 2 coming soon! You can restart this challenge to practice more."
      },
      "promptKey": "restaurant-ordering-level1"
    },
    {
      "id": "playground-boundaries-level2",
      "slug": "playground-boundaries-level2",
      "order": 2,
      "title": "Playground Boundaries Challenge",
      "tagline": "Help Piko stand up for himself when play stops feeling fun.",
      "difficulty": "Level 2",
      "estimatedTime": "10 min",
      "recommendedFor": "Ages 8-11",
      "background": {
        "poster": "/Backgrounds/Animated_Fall_Scene_background_thumb.png",
        "video": "/Backgrounds/Animated_Fall_Scene_background.mp4",
        "themeColor": "#0ea5e9"
      },
      "intro": {
        "heroTitle": "Coach Piko Through a Tricky Playground Moment",
        "heroSubtitle": "Piko's friend Ziggy keeps pressuring him to climb the highest tower even though it feels unsafe. Help Piko set boundaries while staying kind.",
        "mission": "Guide Piko through standing up for himself, choosing safe play, and asking for help when he needs it.",
        "whatYoullCover": [
          "Notice when your body feels unsafe during play.",
          "Say \"no\" firmly but kindly when something feels wrong.",
          "Offer a safer alternative activity to keep the fun going.",
          "Check in on friends who might also feel uncomfortable.",
          "Know when to ask a trusted grown-up for backup."
        ],
        "primaryCta": "Start Challenge",
        "secondaryCta": "Preview Learning Goals",
        "dismissCta": "Maybe Later"
      },
      "todos": [
        {
          "id": 1,
          "text": "Notice when play stops feeling safe",
          "description": "Help Piko trust his body signals and say it's okay to stop"
        },
        {
          "id": 2,
          "text": "Say no firmly but kindly",
          "description": "Teach Piko how to set a clear boundary without being mean"
        },
        {
          "id": 3,
          "text": "Suggest a safer alternative",
          "description": "Coach Piko to offer a different idea that feels safe and fun"
        },
        {
          "id": 4,
          "text": "Check on friends who look uncomfortable",
          "description": "Remind Piko to notice others and stand up for them if needed"
        },
        {
          "id": 5,
          "text": "Ask a grown-up for help when needed",
          "description": "Show Piko that telling an adult is brave when someone won't stop"
        }
      ],
      "conversation": {
        "openingLine": "Hi friend! It's me, Piko! I'm on the playground with Ziggy, and he keeps telling me to climb the super tall tower even though my paws feel wobbly. I don't want to seem boring, but I'm scared. What should I do?",
        "closingLine": "Thank you! Now I know how to listen to my gut, say no with kindness, offer a safer idea, check on my friends, and ask a grown-up when I need backup. I'm braver already!",
        "successQuote": "\"I can say no and still be a good friend!\"",
        "successSubtext": "You helped me keep the playground fun AND safe. Panda high-five!",
        "successEmotion": "My courage is catching up with my curiosity!",
        "successContinueLabel": "Explore another challenge",
        "successRestartLabel": "Try this moment again",
        "successFooter": "Practice makes brave! Replay to role-play different responses."
      },
      "promptKey": "playground-boundaries-level2"
    },
    {
      "id": "class-presentation-confidence-level3",
      "slug": "class-presentation-confidence-level3",
      "order": 3,
      "title": "Stage Fright Confidence Challenge",
      "tagline": "Help Piko present in front of the class without freezing up.",
      "difficulty": "Level 3",
      "estimatedTime": "12 min",
      "recommendedFor": "Ages 9-12",
      "background": {
        "poster": "/Backgrounds/AnimatedVideoBackgroundLooping1_thumb.jpg",
        "video": "/Backgrounds/AnimatedVideoBackgroundLooping1.mp4",
        "themeColor": "#7c3aed"
      },
      "intro": {
        "heroTitle": "Help Piko Shine During Show & Tell",
        "heroSubtitle": "Piko's class presentation is today and his paws won't stop shaking. Coach him through calming down and speaking with confidence.",
        "mission": "Support Piko with strategies to calm nerves, practice his words, and ask for help so he can share proudly.",
        "whatYoullCover": [
          "Using breathing and body resets when nerves spike.",
          "Planning a clear opening sentence to get started.",
          "Using positive self-talk to stay confident.",
          "Looking at friendly faces or anchors while speaking.",
          "Asking the teacher for help or a pause if his mind goes blank."
        ],
        "primaryCta": "Start Challenge",
        "secondaryCta": "Preview Learning Goals",
        "dismissCta": "Maybe Later"
      },
      "todos": [
        {
          "id": 1,
          "text": "Practice a calming breath routine",
          "description": "Teach Piko a quick way to slow his breathing when he feels shaky"
        },
        {
          "id": 2,
          "text": "Plan a simple opening line",
          "description": "Help Piko decide how to start his presentation with confidence"
        },
        {
          "id": 3,
          "text": "Use brave self-talk",
          "description": "Coach Piko to say encouraging words to himself before speaking"
        },
        {
          "id": 4,
          "text": "Look at friendly faces while talking",
          "description": "Show Piko how to find supportive faces or spots in the room"
        },
        {
          "id": 5,
          "text": "Ask for help if his mind goes blank",
          "description": "Remind Piko he can pause and ask the teacher for support"
        }
      ],
      "conversation": {
        "openingLine": "Hey friend... today is my Show & Tell and I feel like my voice is stuck. My heart is thumping like a drum! How do I stop shaking so I can actually talk?",
        "closingLine": "Wow! Now I have my calming breath, an opening line, brave self-talk, friendly faces to look at, and even a plan if I forget. I'm ready to share!",
        "successQuote": "\"I can do this—even if my paws are wobbly!\"",
        "successSubtext": "Your coaching helped me turn stage fright into stage confidence.",
        "successEmotion": "My brave voice is louder than my nerves.",
        "successContinueLabel": "Pick the next challenge",
        "successRestartLabel": "Practice again",
        "successFooter": "Re-run the scenario to help Piko rehearse different parts."
      },
      "promptKey": "class-presentation-confidence-level3"
    }
  ]
}
